// Тут будем экспортировать Обсервабл инициализации
// В процессе инициализации мы должны:
// 0. Проверить наличие необходимых для работы env-ов
// 1. Проверить доступность Anytype API
// 2. Существование целевого спейса
// 3. ПРОВЕРИТЬ ПЕРМИШЕНЫ (Должен быть EDITOR)
// 4. Создать чат с ботом (если еще нет)
// 5. Проверить наличие типа "Agent Response"
// 6. Создать его по АПИ (если еще нет)
//
// Сделать complete экспортированного Обсервабла с данными (какими?)
// Наверное с chat ID, именем бота и Agent Response ID...
